# AllModelUrl Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AllModelUrl Property
ParameterTypeId Class See Also
---
"URL"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AllModelUrl { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AllModelUrl As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AllModelUrl {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace